In [244]:
import pandas as pd
import os

In [3]:
pip install xlrd

Requirement already satisfied: xlrd in /opt/anaconda3/lib/python3.7/site-packages (2.0.1)

[notice] A new release of pip available: 22.3.1 -> 23.0.1
[notice] To update, run: pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [4]:
#print(os.getcwd())
os.chdir("/Users/margaretdemchak/Desktop/DA_401/NEA_grant_data")
#print(os.getcwd())

In [57]:
#Data from National Endowment of the Arts
# read excel file
df_boston = pd.read_excel('Boston_grant.xlsx')
df_cbus = pd.read_excel('Columbus_grant.xlsx')
df_dallas = pd.read_excel('Dallas_grant.xlsx')
df_indy = pd.read_excel('Indy_grant.xlsx')
df_nyc = pd.read_excel('NYC_grant.xlsx')
df_sanfran = pd.read_excel('SanFran_grant.xlsx')

/opt/anaconda3/lib/python3.7/site-packages/openpyxl/styles/stylesheet.py:226: UserWarning: Workbook contains no default style, apply openpyxl's default
  warn("Workbook contains no default style, apply openpyxl's default")

In [58]:
df_boston.head(5)

,Organization Name,Popular Name,Discipline / Field,Category,Application Number,City,State,Zip,Project Description,Fiscal Year,Congressional District,Grant Amount,Grant From Date,Grant To Date
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaT,NaT
1,"Artists for Humanity, Inc.",aka AFH,Visual Arts,Grants for Arts Projects,1895283-41-22,Boston,MA,02127-1112,Purpose: To support a painting and photography...,2022.0,8.0,20000.0,2022-06-01,2023-05-31
2,"Artists for Humanity, Inc.",aka AFH,Visual Arts,Grants for Arts Projects,1884032-41-21,Boston,MA,02127-1112,"To support a painting, photography, and video ...",2021.0,8.0,30000.0,2021-06-01,2022-05-31
3,"Artists for Humanity, Inc.",aka AFH,Visual Arts,Art Works,1861577-41-20,Boston,MA,02127-1112,"To support a painting, photography, and video ...",2020.0,8.0,25000.0,2020-06-01,2021-05-31
4,"Artists for Humanity, Inc.",aka AFH,Visual Arts,Art Works,1808125-41-18,Boston,MA,02127-1112,"To support a painting, photography, and video ...",2018.0,8.0,40000.0,2018-06-01,2019-05-31

In [59]:
def tidy_dfs(dfs):
    for df in dfs:
        # Drop first row
        df.drop(df.index[0], inplace=True)
        # Replace 
        df['Fiscal Year']=df['Fiscal Year'].astype(str).str.replace('.0', ' ', regex=False)
        df['Grant Amount']=df['Grant Amount'].astype(str).str.replace('.0', ' ', regex=False)

    return dfs

df_boston, df_cbus, df_dallas, df_indy, df_nyc, df_sanfran = tidy_dfs([df_boston, df_cbus, df_dallas, df_indy, df_nyc, df_sanfran])

In [60]:
df_cbus.head(5)

,Organization Name,Popular Name,Discipline / Field,Category,Application Number,City,State,Zip,Project Description,Fiscal Year,Congressional District,Grant Amount,Grant From Date,Grant To Date
1,Arts Foundation of Olde Towne,NaN,Challenge America,Challenge America Community Arts Development,02-7816-1439,Columbus,OH,43215-3978,To support a Community Arts Development projec...,2002,3.0,10000,2002-09-01,2003-08-31
2,Arts Foundation of Olde Towne,NaN,Challenge America,Challenge America Community Arts Development,01-7816-1370,Columbus,OH,43215-3978,To support a Community Arts Development projec...,2001,3.0,10000,2001-09-01,2002-08-31
3,"Awad, Ruth",NaN,Literary Arts,Literature Fellowships: Creative Writing,1868719-52-21,Columbus,OH,43202-2238,To support activities that contribute to your ...,2021,12.0,25000,2021-01-01,2022-12-31
4,"Ballet Metropolitan, Inc.",aka BalletMet,Dance,Grants for Arts Projects,1904849-33-23,COLUMBUS,OH,43215-2131,Purpose: To support artist fees for a mixed-re...,2023,3.0,10000,2023-01-01,2023-06-30
5,"Ballet Metropolitan, Inc.",aka BalletMet,Dance,Grants for Arts Projects,1888297-33-22,COLUMBUS,OH,43215-2131,Purpose: To support dancer salaries and licens...,2022,3.0,10000,2022-01-01,2022-06-30

In [61]:
def total_grant(dfs):
    for df in dfs:
        #create total column for amount of grant money recieved
        df['Grant Amount'] = pd.to_numeric(df['Grant Amount'],errors='coerce')
        df['total_grant'] = df['Grant Amount'].sum()

    return dfs

df_boston, df_cbus, df_dallas, df_indy, df_nyc, df_sanfran = total_grant([df_boston, df_cbus, df_dallas, df_indy, df_nyc, df_sanfran])

In [84]:
df_total=pd.DataFrame()
df_total=df_total.append(df_boston.iloc[0])
df_total=df_total.append(df_cbus.iloc[0])
df_total=df_total.append(df_dallas.iloc[0])
df_total=df_total.append(df_indy.iloc[0])
df_total=df_total.append(df_nyc.iloc[0])
df_total=df_total.append(df_sanfran.iloc[0])

In [88]:
df_total1 = df_total.drop(['Category','Organization Name', 'Popular Name', 'Discipline / Field', 'Application Number'
                           ,'Zip','Project Description','Fiscal Year', 'Congressional District' , 
                           'Grant Amount', 'Grant From Date', 'Grant To Date'], axis=1) #do not need these varibles

In [100]:
df_total1

            City State   total_grant
1         Boston    MA  7.774451e+07
1       Columbus    OH  2.883987e+07
1         Dallas    TX  8.532753e+06
1   Indianapolis    IN  2.503262e+07
1       New York    NY  2.957641e+08
1  San Francisco    CA  6.293751e+07

In [92]:
all_cities = pd.concat([df_boston, df_cbus, df_dallas, df_indy, df_nyc, df_sanfran],    # Combine vertically
                          ignore_index = True,
                          sort = False)

In [93]:
len(all_cities)

11800

In [94]:
all_cities.to_csv('all_cities_nea.csv')

In [98]:
df_total1['City']=df_total1['City'].astype(str).apply(str.title)

In [99]:
df_total1['City']

1           Boston
1         Columbus
1           Dallas
1     Indianapolis
1         New York
1    San Francisco
Name: City, dtype: object

In [102]:
os.chdir("/Users/margaretdemchak/Desktop/DA_401/gdp_data")

In [179]:
#data from Bureau of Economic Analysis
gdp_data = pd.ExcelFile('gdp-per-capita-2020-by-metro-area.xlsx')
df_gdp = pd.read_excel(gdp_data, 'Data')
df_gdp

                             Unnamed: 0  Unnamed: 1
0                          Midland, TX    210008.44
1   San Jose-Sunnyvale-Santa Clara, CA    171505.81
2   San Francisco-Oakland-Berkeley, CA    110942.96
3          Seattle-Tacoma-Bellevue, WA     93955.57
4                Trenton-Princeton, NJ     84972.51
..                                  ...         ...
95                         Lincoln, NE     52762.25
96                       Iowa City, IA     52728.00
97               New Haven-Milford, CT     52718.21
98                  Urban Honolulu, HI     52352.28
99                        Billings, MT     52317.24

[100 rows x 2 columns]

In [180]:
df_gdp.columns = ['metro_area', 'gdp_per_capita']

In [181]:
df_gdp.head(5)

                            metro_area  gdp_per_capita
0                         Midland, TX        210008.44
1  San Jose-Sunnyvale-Santa Clara, CA        171505.81
2  San Francisco-Oakland-Berkeley, CA        110942.96
3         Seattle-Tacoma-Bellevue, WA         93955.57
4               Trenton-Princeton, NJ         84972.51

In [182]:
df_gdp6 = df_gdp[(df_gdp["metro_area"] == "Dallas-Fort Worth-Arlington, TX ") | (df_gdp["metro_area"] == "Indianapolis-Carmel-Anderson, IN ") 
                 | (df_gdp["metro_area"] == "Columbus, OH ")| 
                 (df_gdp["metro_area"] == "New York-Newark-Jersey City, NY-NJ-PA ")| 
                 (df_gdp["metro_area"] == "Boston-Cambridge-Newton, MA-NH ")| (df_gdp["metro_area"] == "San Francisco-Oakland-Berkeley, CA ")]

In [183]:
print(df_gdp6)

                                metro_area  gdp_per_capita
2      San Francisco-Oakland-Berkeley, CA        110942.96
5          Boston-Cambridge-Newton, MA-NH         83596.75
10  New York-Newark-Jersey City, NY-NJ-PA         74689.26
33        Dallas-Fort Worth-Arlington, TX         62255.63
45       Indianapolis-Carmel-Anderson, IN         59322.19
71                           Columbus, OH         54708.92

In [320]:
df_gdp6['Metro_area'], df_gdp6['State'] = df_gdp6['metro_area'].str.rsplit(',', 1).str

/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Columnar iteration over characters will be deprecated in future releases.
  """Entry point for launching an IPython kernel.
/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [321]:
df_gdp6

,metro_area,gdp_per_capita,Metro_area,State
2,"San Francisco-Oakland-Berkeley, CA",110942.96,San Francisco-Oakland-Berkeley,CA
5,"Boston-Cambridge-Newton, MA-NH",83596.75,Boston-Cambridge-Newton,MA-NH
10,"New York-Newark-Jersey City, NY-NJ-PA",74689.26,New York-Newark-Jersey City,NY-NJ-PA
33,"Dallas-Fort Worth-Arlington, TX",62255.63,Dallas-Fort Worth-Arlington,TX
45,"Indianapolis-Carmel-Anderson, IN",59322.19,Indianapolis-Carmel-Anderson,IN
71,"Columbus, OH",54708.92,Columbus,OH

In [324]:
df_gdp6['State'] = df_gdp6['State'].str.replace("-NH", "")

/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [327]:
df_gdp6['State'] = df_gdp6['State'].str.replace("-NJ-PA", "")

/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [328]:
print(df_gdp6)

,metro_area,gdp_per_capita,Metro_area,State
2,"San Francisco-Oakland-Berkeley, CA",110942.96,San Francisco-Oakland-Berkeley,CA
5,"Boston-Cambridge-Newton, MA-NH",83596.75,Boston-Cambridge-Newton,MA
10,"New York-Newark-Jersey City, NY-NJ-PA",74689.26,New York-Newark-Jersey City,NY
33,"Dallas-Fort Worth-Arlington, TX",62255.63,Dallas-Fort Worth-Arlington,TX
45,"Indianapolis-Carmel-Anderson, IN",59322.19,Indianapolis-Carmel-Anderson,IN
71,"Columbus, OH",54708.92,Columbus,OH

In [365]:
df_total1

            City State   total_grant
1         Boston    MA  7.774451e+07
1       Columbus    OH  2.883987e+07
1         Dallas    TX  8.532753e+06
1   Indianapolis    IN  2.503262e+07
1       New York    NY  2.957641e+08
1  San Francisco    CA  6.293751e+07

In [350]:
total_grant = ['6.293751e+07', '7.774451e+07', '2.957641e+08', '8.532753e+06','2.503262e+07','2.883987e+07']

# equating it to the list
df_gdp6['total_grant'] = total_grant

/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """

In [360]:
df_gdp6['total_grant']=df_gdp6['total_grant'].astype(float)

/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [362]:
df_gdp6["grant_per_gdp"] = df_gdp6["total_grant"] // df_gdp6["gdp_per_capita"]
print(df_gdp6)

                                metro_area  gdp_per_capita  \
2      San Francisco-Oakland-Berkeley, CA        110942.96
5          Boston-Cambridge-Newton, MA-NH         83596.75
10  New York-Newark-Jersey City, NY-NJ-PA         74689.26
33        Dallas-Fort Worth-Arlington, TX         62255.63
45       Indianapolis-Carmel-Anderson, IN         59322.19
71                           Columbus, OH         54708.92

                        Metro_area State  total_grant  grant_per_gdp
2   San Francisco-Oakland-Berkeley   CA    62937510.0          567.0
5          Boston-Cambridge-Newton   MA    77744510.0          929.0
10     New York-Newark-Jersey City   NY   295764100.0         3959.0
33     Dallas-Fort Worth-Arlington   TX     8532753.0          137.0
45    Indianapolis-Carmel-Anderson   IN    25032620.0          421.0
71                        Columbus   OH    28839870.0          527.0

/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [368]:
city = ['San Francisco', 'Boston', 'New York', 'Dallas','Indianapolis','Columbus']

# equating it to the list
df_gdp6['city'] = city

/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  after removing the cwd from sys.path.

In [369]:
print(df_gdp6)

                                metro_area  gdp_per_capita  \
2      San Francisco-Oakland-Berkeley, CA        110942.96
5          Boston-Cambridge-Newton, MA-NH         83596.75
10  New York-Newark-Jersey City, NY-NJ-PA         74689.26
33        Dallas-Fort Worth-Arlington, TX         62255.63
45       Indianapolis-Carmel-Anderson, IN         59322.19
71                           Columbus, OH         54708.92

                        Metro_area State  total_grant  grant_per_gdp  \
2   San Francisco-Oakland-Berkeley   CA    62937510.0          567.0
5          Boston-Cambridge-Newton   MA    77744510.0          929.0
10     New York-Newark-Jersey City   NY   295764100.0         3959.0
33     Dallas-Fort Worth-Arlington   TX     8532753.0          137.0
45    Indianapolis-Carmel-Anderson   IN    25032620.0          421.0
71                        Columbus   OH    28839870.0          527.0

             city
2   San Francisco
5          Boston
10       New York
33         Dallas
45   Indianapolis
71       Columbus

In [371]:
df_gdp6.to_csv('df_gdp_grant1.csv')